<?php
                                         
// PHP7/HTML5, EDGE/CHROME                        *** T_ToolsTestCommon.php ***

// ****************************************************************************
// * TPhpTools                                   Блок общих функций TPhpTools *
// *                                                                          *
// * v1.0, 17.03.2020                              Автор:       Труфанов В.Е. *
// * Copyright © 2020 tve                          Дата создания:  18.12.2020 *
// ****************************************************************************

// ****************************************************************************
// *          Проверить существование и удалить файл из файловой системы      *
// ****************************************************************************
function UnlinkFile($filename)
{
   if (file_exists($filename)) 
   {
      if (!unlink($filename))
      {
         // Выводим сообщение о неудачном удалении файла базы данных в случаях:
         // а) база данных подключена к стороннему приложению;
         // б) база данных еще привязана к другому объекту класса;
         // в) прочее
         throw new Exception("Не удалось удалить тестовую базу данных $filename!");
      } 
   } 
}
// ************************************************** T_ToolsTestCommon.php ***
