<?php
// PHP7/HTML5, EDGE/CHROME                                    *** Proba.php ***

// ****************************************************************************
// * TPhpTools-test                          Развернуть правую часть экрана - *
// *                                                  выполнить заданный тест *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 30.12.2020

echo 'Класс: '.$classTT.'<br>';

// <!-- --> ************************************************** TestsDiv.php ***
