<?php namespace ttools; 
                                         
// PHP7/HTML5, EDGE/CHROME                                *** CommonOwn.php ***

// ****************************************************************************
// * TPhpTools                     Блок функций класса TArticleMaker для базы *
// *                                                 данных материалов сайта. *
// *                                                                          *
// * v1.0, 13.11.2022                              Автор:       Труфанов В.Е. *
// * Copyright © 2022 tve                          Дата создания:  13.11.2022 *
// ****************************************************************************

// ********************************************************** CommonOwn.php ***
