<?php // WIN10\XP                                           *** CtrlDir.php ***

// ****************************************************************************
// * CTRLDIR [0100] v1.0                        Контроллер каталогов и файлов *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  05.10.2016
// Copyright © 2016 TVE                              Посл.изменение: 18.10.2016

class TCtrlDir {
// Прообразы дерева сайта
var $a_fdir =array();   // Каталоги файлов
var $a_fname=array();   // Имена файлов
var $a_fsize=array();   // Размеры файлов
var $a_fdtime=array();  // Даты, время изменений файлов
// Позиционирование 
var $cofiles;           // Позиционирование по элементам массивов
var $colevel;           // Позиционирование по уровню вложенности каталогов
   
// ****************************************************************************
// *               Проинициализировать параметры объекта класса               *
// ****************************************************************************
function Init() {
  $this->cofiles=0;
  $this->colevel=0;
} // Init
   
// ****************************************************************************
// *                    Выбрать информацию о файлах каталога                  *
// ****************************************************************************
function MakeFiles($in_dir){
  // Трассируем строку с именем каталога
  // echo "<hr> DIR:  $in_dir <hr>";
  // Просматриваем каталог и отбираем все файлы из него
  if ($dir_handle=@opendir($in_dir)) {
    while($file=readdir($dir_handle)) {
      if (is_file($in_dir."/".$file) && $file!=".." && $file!=".") {
    	// Трассируем строку со спецификацией файла
	    // echo "FILE:  $in_dir"."/"."$file <hr>";
        // Заполняем массив с прообразами дерева сайта
        $this->a_fdir [$this->cofiles]=$in_dir;
	    $this->a_fname[$this->cofiles]=$file;
        $this->a_fsize[$this->cofiles]=filesize ($in_dir."/".$file);
        $this->a_fdtime[$this->cofiles]=filemtime ($in_dir."/".$file);
        $this->cofiles++;
	  }
    }
  }
} // MakeFiles 
   
// ****************************************************************************
// *    Выполнить проход по дереву каталогов файловой системы,  уложить во    *
// * внутренние массивы информацию о файлах и каталогах, выполняя рекурсивный *
// *         обход. Параметр $colevel задает текущую глубину рекурсии.        *
// ****************************************************************************
function MakeTree() {
  $this->colevel+1;
  // Открываем каталог и выходим в случае ошибки.
  $d = @opendir("."); 
  if (!$d) return;
  while (($e=readdir($d)) !== false) {
    // Игнорируем элементы .. и .
    if ($e=='.' || $e=='..') continue;
    // Нам нужны только подкаталоги.
    if (!@is_dir($e)) continue;
	$s=getcwd().'/'.$e;
    $this->MakeFiles($s); 
    // Входим в текущий подкаталог и печатаем его
    if (!chdir($e)) continue;
    $this->MakeTree();
    // Возвращаемся назад
	//echo "do ".getcwd()."<hr>";
    chdir("..");
	//echo "posle ".getcwd();
    // Отправляем данные в браузер, чтобы избежать видимости зависания
    // для больших распечаток
    flush();
  }
  closedir($d);
} // MakeTree
   
// ****************************************************************************
// *                 Вывести список файлов сайта в виде таблицы,              *
// *                      подсуммировать общий размер файлов                  *
// ****************************************************************************
function Show() { 
  echo "<center><table border=\"1\">
	<tr align=\"center\"> 
	  <td>i</td><td>name</td><td>size</td><td>dir</td><td>dtime</td>
    </tr>";
  $a_size=0; 
  for ($i=0;$i<count($this->a_fname);$i++) {
    echo 
	  "<tr align=\"center\">
	    <td>".($i+1)."</td>
		<td>".$this->a_fname[$i]."</td>
		<td>".$this->a_fsize[$i]."</td>
		<td> ".$this->a_fdir[$i]."</td>
		<td> ".date("Y.m.d H:i:s.",$this->a_fdtime[$i])."</td>
	  </tr>";
    $a_size+=$this->a_fsize[$i];
  }
  echo "<tr><td colspan=\"2\">Total:</td><td colspan=\"2\">$a_size</td></tr>";
  echo "</table></center>";
} // Show
   
// ****************************************************************************
// *                   Вывести список каталогов и файлов сайта                *
// ****************************************************************************
function ViewList() { 
  $vlDir="NoDef"; 
  echo ("<hr>");
  for ($i=0;$i<count($this->a_fname);$i++) {
    if ($vlDir!=$this->a_fdir[$i]) {
	  $vlDir=$this->a_fdir[$i];
	  echo ("<hr>". "$vlDir"."<hr>");
	};
    $vlFile=$this->a_fname[$i];
    echo ("$vlDir"."/"."$vlFile"."<hr>");
  }
} // ViewList
} // TCtrlDir

// ********************************************************* CtrlDir.php *** ?> 
